<a href="https://colab.research.google.com/github/bmt21409/bmt_pyson/blob/main/21409_10%EC%A3%BC%EC%B0%A8%EC%8B%A4%EC%8A%B5.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [3]:
dates = pd.date_range('20210507', periods=6)

In [70]:
row = pd.date_range('20210507', periods=6)
col = list('ABCD')
df = pd.DataFrame(np.random.randn(6,4), index=row, columns=col)

In [ ]:
df

In [72]:
s1 = pd.Series([1, 2, 3, 4, 5, 6], index=pd.date_range('20210507', periods=6))

In [73]:
df['F'] = s1

In [ ]:
df

In [ ]:
df>0

In [ ]:
df[df>0]

In [ ]:
df2 = df.copy()
df2

In [79]:
df2[df2>0] = -df

In [ ]:
df2

In [ ]:
df

In [ ]:
df.mean()

In [ ]:
df.mean(1)

In [ ]:
print(df.apply(np.cumsum));print() # 데이터에 함수를 적용
# np.cumsum : 배열에서 주어진 축에 따라 누적되는 원소들의 누적 합을 계산하는 함수

print(df.apply(lambda x: x.max() - x.min())) # 행에 대해 함수 적용

In [ ]:
df.apply(np.cumsum)

In [ ]:
df.apply(np.cumsum, axis=1)

In [ ]:
df

In [ ]:
df.apply(lambda x: x.max() - x.min(), axis=1)

In [ ]:
df

In [109]:
s = pd.Series(np.random.randint(1, 7, size = 999))
s.value_counts()

5    181
3    176
1    173
6    162
2    155
4    152
dtype: int64

In [110]:
df = pd.DataFrame(np.random.randn(10, 4))

In [112]:
                                                                                                                                                                                                                                                                                                                        
                                                                                                                                                                                                                                                                                                                        
                                                                                                                                                                                                                                                                                                                        
                                                                                                                                                                                                                                                                                                                        df[:3]

          0         1         2         3
0 -0.013500 -0.117356 -0.374637 -1.417679
1  1.041740  0.055896  0.023298 -0.719796
2  0.900685  0.083884 -0.607588  2.062037

In [114]:
[df[:3], df[3:7], df[7:]]

[          0         1         2         3
 0 -0.013500 -0.117356 -0.374637 -1.417679
 1  1.041740  0.055896  0.023298 -0.719796
 2  0.900685  0.083884 -0.607588  2.062037,
           0         1         2         3
 3  0.043124  0.289902  1.631761  0.272373
 4 -0.096165  0.637245  0.452226  1.138242
 5  0.459545 -0.011260 -0.287591 -1.259964
 6 -1.515905 -0.370710 -0.161039  0.547941,
           0         1         2         3
 7 -0.039615  1.565180 -1.194257 -0.447439
 8 -1.316461  1.646204 -1.316522 -0.019840
 9 -1.316582  2.264315  0.428386 -1.133561]

In [115]:
df[3:7]

          0         1         2         3
3  0.043124  0.289902  1.631761  0.272373
4 -0.096165  0.637245  0.452226  1.138242
5  0.459545 -0.011260 -0.287591 -1.259964
6 -1.515905 -0.370710 -0.161039  0.547941

In [117]:
df[7:]

          0         1         2         3
7 -0.039615  1.565180 -1.194257 -0.447439
8 -1.316461  1.646204 -1.316522 -0.019840
9 -1.316582  2.264315  0.428386 -1.133561

In [120]:
 [df[:3], df[3:7], df[7:]]

[          0         1         2         3
 0 -0.013500 -0.117356 -0.374637 -1.417679
 1  1.041740  0.055896  0.023298 -0.719796
 2  0.900685  0.083884 -0.607588  2.062037,
           0         1         2         3
 3  0.043124  0.289902  1.631761  0.272373
 4 -0.096165  0.637245  0.452226  1.138242
 5  0.459545 -0.011260 -0.287591 -1.259964
 6 -1.515905 -0.370710 -0.161039  0.547941,
           0         1         2         3
 7 -0.039615  1.565180 -1.194257 -0.447439
 8 -1.316461  1.646204 -1.316522 -0.019840
 9 -1.316582  2.264315  0.428386 -1.133561]

In [119]:
pd.concat(pieces)

          0         1         2         3
0 -0.013500 -0.117356 -0.374637 -1.417679
1  1.041740  0.055896  0.023298 -0.719796
2  0.900685  0.083884 -0.607588  2.062037
3  0.043124  0.289902  1.631761  0.272373
4 -0.096165  0.637245  0.452226  1.138242
5  0.459545 -0.011260 -0.287591 -1.259964
6 -1.515905 -0.370710 -0.161039  0.547941
7 -0.039615  1.565180 -1.194257 -0.447439
8 -1.316461  1.646204 -1.316522 -0.019840
9 -1.316582  2.264315  0.428386 -1.133561

In [122]:

left = pd.DataFrame(
    {
        'key':['foo', 'foo'], 
        'lval': [1, 2]
     })
right = pd.DataFrame(
    {
        'key':['foo', 'foo'],
        'rval': [4, 5]
     })

In [123]:
left

   key  lval
0  foo     1
1  foo     2

In [124]:
right

   key  rval
0  foo     4
1  foo     5

In [126]:
df = pd.DataFrame(
    {
        'A' : ['foo', 'bar', 'foo', 'bar', 'foo', 'bar', 'foo', 'bar'],
        'B' : ['one', 'one', 'two', 'three', 'two', 'two', 'one', 'three'],
        'C' : np.random.randn(8),
        'D' : np.random.randn(8)
    }
)

In [128]:
df

     A      B         C         D
0  foo    one -0.274297  1.476200
1  bar    one -0.707288 -0.085248
2  foo    two  1.029986 -1.013109
3  bar  three  0.078156 -1.216701
4  foo    two -1.335907 -0.230377
5  bar    two -0.235373  0.162772
6  foo    one -0.812075  0.339813
7  bar  three -2.229889 -0.129098

In [129]:
print(df);print()

     A      B         C         D
0  foo    one -0.274297  1.476200
1  bar    one -0.707288 -0.085248
2  foo    two  1.029986 -1.013109
3  bar  three  0.078156 -1.216701
4  foo    two -1.335907 -0.230377
5  bar    two -0.235373  0.162772
6  foo    one -0.812075  0.339813
7  bar  three -2.229889 -0.129098

In [133]:
a = df.groupby('B').sum() 
print(a);print()

              C         D
B
one   -1.793660  1.730765
three -2.151733 -1.345799
two   -0.541294 -1.080714

In [137]:
a = df.groupby('A').sum() 
a

            C         D
A
bar -3.094394 -1.268275
foo -1.392293  0.572526

In [147]:
a = df.groupby(['A','B']).sum()
a

                  C         D
A   B
bar one   -0.707288 -0.085248
    three -2.151733 -1.345799
    two   -0.235373  0.162772
foo one   -1.086372  1.816012
    two   -0.305921 -1.243486

In [148]:
























x = [1, 2, 3]
y = [4, 5, 6]
zipped = zip(x,y)
zipped

In [139]:
list(zipped)

[(1, 4), (2, 5), (3, 6)]

In [141]:
x2, y2 = zip(*zip(x,y))
list(zipped)

[]

In [142]:
x2

(1, 2, 3)

In [143]:
y2

(4, 5, 6)

In [149]:
df = pd.DataFrame(
    {
        'A' : ['one', 'one', 'two', 'three'] * 3,
        'B' : ['A', 'B', 'C'] * 4,
        'C' : ['foo', 'foo', 'foo', 'bar', 'bar', 'bar' ] * 2,
        'D' : np.random.randn(12),
        'E' : np.random.randn(12)
    }
)

In [150]:
df

        A  B    C         D         E
0     one  A  foo -2.068871  1.007257
1     one  B  foo  0.017993 -0.180852
2     two  C  foo  0.803703  0.565293
3   three  A  bar -1.527442 -0.336806
4     one  B  bar  0.621397 -0.183596
5     one  C  bar -0.323052 -0.677948
6     two  A  foo -0.360682 -0.330881
7   three  B  foo  0.421316 -0.824672
8     one  C  foo -0.956980 -0.278001
9     one  A  bar  0.555502  0.286395
10    two  B  bar -1.108821  0.519559
11  three  C  bar -1.233627 -0.063580

In [153]:
pd.pivot_table(df, values = 'D',
               index = ['A', ],
               columns = ['C'])

C           bar       foo
A
one    0.284616 -1.002619
three -1.380535  0.421316
two   -1.108821  0.221511

In [154]:
'B'

'B'

In [155]:
pd.pivot_table(df, values = 'D',
               index = ['A','B' ],
               columns = ['C'])

C             bar       foo
A     B
one   A  0.555502 -2.068871
      B  0.621397  0.017993
      C -0.323052 -0.956980
three A -1.527442       NaN
      B       NaN  0.421316
      C -1.233627       NaN
two   A       NaN -0.360682
      B -1.108821       NaN
      C       NaN  0.803703